function [DR,DL] = VContinuityInfo3(N)
%% 3次V-系统前N组[(k+1)2^(N -1)项]基函数在节点处的连续性信息

k = 3;
VNum = (k+1)*2^(N-1);             % 基函数数目
knots = linspace(0,1,2^(N-1)+1);  % 节点向量

DR = zeros(VNum,2^(N-1)+1,k+1);   % 基函数在各节点处的0~3阶右导数
DL = DR;                          % 基函数在各节点处的0~3阶左导数

%% Legendre多项式(2~4)
[l2,l3,l4] = LegDerivatives(knots);
for i = 1 : 4
    DR(2,1:end-1,i) = l2(i,1:end-1);
    DR(3,1:end-1,i) = l3(i,1:end-1);
    DR(4,1:end-1,i) = l4(i,1:end-1);
    
    DL(2,2:end,i) = l2(i,2:end);
    DL(3,2:end,i) = l3(i,2:end);
    DL(4,2:end,i) = l4(i,2:end);
end

%% 生成元（5~8）
x1 = knots(find(knots<1/2));
x2 = knots(find(knots>=1/2 & knots<1));
DR(5:8,1:end-1,1) = [sqrt(7)*[-64 * x1.^3 + 66 * x1.^2 - 18 * x1 + 1,64 * x2.^3 - 126 * x2.^2 + 78 * x2 - 15];
                     sqrt(5)*[-140 * x1.^3 + 114 * x1.^2 - 24 * x1 + 1,-140 * x2.^3 + 306 * x2.^2 - 216 * x2 + 49];
                     sqrt(3)*[-224 * x1.^3 + 156 * x1.^2 - 28 * x1 + 1,224 * x2.^3 - 516 * x2.^2 + 388 * x2 - 95];
                     [-280 * x1.^3 + 180 * x1.^2 - 30 * x1 + 1,-280 * x2.^3 + 660 * x2.^2 - 510 * x2 + 129]];
DR(5:8,1:end-1,2) = [sqrt(7)*[-192 * x1.^2 + 132 * x1 - 18,192 * x2.^2 - 252 * x2 + 78];
                     sqrt(5)*[-420 * x1.^2 + 228 * x1 - 24,-420 * x2.^2 + 612 * x2 - 216];
                     sqrt(3)*[-672 * x1.^2 + 312 * x1 - 28,672 * x2.^2 - 1032 * x2 + 388];
                     [-840 * x1.^2 + 360 * x1 - 30,-840 * x2.^2 + 1320 * x2 - 510]];
DR(5:8,1:end-1,3) = [sqrt(7)*[-384 * x1 + 132,384 * x2 - 252]; 
                     sqrt(5)*[-840 * x1 + 228,-840 * x2 + 612];
                     sqrt(3)*[-1344 * x1 + 312,1344 * x2 - 1032];
                     [-1680 * x1 + 360,-1680*x2+1320]];
DR(5:8,1:end-1,4) = [sqrt(7)*[repmat(-384,[1,size(x1,2)]),repmat(384,[1,size(x2,2)])];
                    sqrt(5)*[repmat(-840,[1,size(x1,2)]),repmat(-840,[1,size(x2,2)])];
                    sqrt(3)*[repmat(-1344,[1,size(x1,2)]),repmat(1344,[1,size(x2,2)])];
                    [repmat(-1680,[1,size(x1,2)]),repmat(-1680,[1,size(x2,2)])]];
                
x1 = knots(find(knots>0 & knots<=1/2));
x2 = knots(find(knots>1/2));
DL(5:8,2:end,1) = [sqrt(7)*[-64 * x1.^3 + 66 * x1.^2 - 18 * x1 + 1,64 * x2.^3 - 126 * x2.^2 + 78 * x2 - 15];
                     sqrt(5)*[-140 * x1.^3 + 114 * x1.^2 - 24 * x1 + 1,-140 * x2.^3 + 306 * x2.^2 - 216 * x2 + 49];
                     sqrt(3)*[-224 * x1.^3 + 156 * x1.^2 - 28 * x1 + 1,224 * x2.^3 - 516 * x2.^2 + 388 * x2 - 95];
                     [-280 * x1.^3 + 180 * x1.^2 - 30 * x1 + 1,-280 * x2.^3 + 660 * x2.^2 - 510 * x2 + 129]];
DL(5:8,2:end,2) = [sqrt(7)*[-192 * x1.^2 + 132 * x1 - 18,192 * x2.^2 - 252 * x2 + 78];
                     sqrt(5)*[-420 * x1.^2 + 228 * x1 - 24,-420 * x2.^2 + 612 * x2 - 216];
                     sqrt(3)*[-672 * x1.^2 + 312 * x1 - 28,672 * x2.^2 - 1032 * x2 + 388];
                     [-840 * x1.^2 + 360 * x1 - 30,-840 * x2.^2 + 1320 * x2 - 510]];
DL(5:8,2:end,3) = [sqrt(7)*[-384 * x1 + 132,384 * x2 - 252]; 
                     sqrt(5)*[-840 * x1 + 228,-840 * x2 + 612];
                     sqrt(3)*[-1344 * x1 + 312,1344 * x2 - 1032];
                     [-1680 * x1 + 360,-1680*x2+1320]];
DL(5:8,2:end,4) = [sqrt(7)*[repmat(-384,[1,size(x1,2)]),repmat(384,[1,size(x2,2)])];
                    sqrt(5)*[repmat(-840,[1,size(x1,2)]),repmat(-840,[1,size(x2,2)])];
                    sqrt(3)*[repmat(-1344,[1,size(x1,2)]),repmat(1344,[1,size(x2,2)])];
                    [repmat(-1680,[1,size(x1,2)]),repmat(-1680,[1,size(x2,2)])]];                

DR_Gen = DR(5:8,1:end-1,:);
DL_Gen = DL(5:8,2:end,:);
                
%% 后续各层
for n = 3 : N
    NumJ = 2^(n-2);
    KontSeg = [reshape([1:2^(N-1)]',[],NumJ)]';
%     KontSeg_R = [reshape([1:2^(N-1)]',[],NumJ)]';
%     KontSeg_L = [reshape([2:2^(N-1)+1]',[],NumJ)]';
    DR_n = sqrt(NumJ)*DR_Gen(:,1:NumJ:end,:);
    DL_n = sqrt(NumJ)*DL_Gen(:,fliplr(end:-NumJ:1),:);
    for j = 1 : NumJ
        vidx = [0;1;2;3]*NumJ+j+2^n;
        DR(vidx,KontSeg(j,:),:) = DR_n;
        DL(vidx,KontSeg(j,:)+1,:) = DL_n;
    end

    for c = 1 : 3
        DR(2^n+1:2^(n+1),:,c+1) = 2^(c*(n-2))*DR(2^n+1:2^(n+1),:,c+1);
        DL(2^n+1:2^(n+1),:,c+1) = 2^(c*(n-2))*DL(2^n+1:2^(n+1),:,c+1);
    end
      
end
                
                
%% Legendre多项式(2~4)
function [g2,g3,g4] = LegDerivatives(x)
    g2 = sqrt(3)*[1-2*x;-2*ones(size(x));0*ones(size(x));0*ones(size(x))];
    g3 = sqrt(5)*[6 * x.^2 - 6 * x + 1;12 * x - 6;12*ones(size(x));0*ones(size(x))];
    g4 = sqrt(7)*[-20 * x.^3 + 30 * x.^2 - 12 * x + 1;-60 * x.^2 + 60 * x - 12;-120 * x + 60;-120*ones(size(x))];
    %g = [g2 g3 g4];
end

% %% 生成元
% function g = GenDerivatives(x)
% 
% if x>=0 && x<1/2
%    g1 = sqrt(7)*[-64 * x.^3 + 66 * x.^2 - 18 * x + 1;-192 * x.^2 + 132 * x - 18;-384 * x + 132;-384]; 
%    g2 = sqrt(5)*[-140 * x.^3 + 114 * x.^2 - 24 * x + 1;-420 * x.^2 + 228 * x - 24;-840 * x + 228;-840];
%    g3 = sqrt(3)*[-224 * x.^3 + 156 * x.^2 - 28 * x + 1;-672 * x.^2 + 312 * x - 28;-1344 * x + 312;-1344];
%    g4 = [-280 * x.^3 + 180 * x.^2 - 30 * x + 1;-840 * x.^2 + 360 * x - 30;-1680 * x + 360;-1680];
%    g = [g1 g2 g3 g4];
% elseif x>1/2 && x<=1
%     g1 = sqrt(7)*[64 * x.^3 - 126 * x.^2 + 78 * x - 15;192 * x.^2 - 252 * x + 78;384 * x - 252;384];
%     g2 = sqrt(5)*[-140 * x.^3 + 306 * x.^2 - 216 * x + 49;-420 * x.^2 + 612 * x - 216;-840 * x + 612;-840];
%     g3 = sqrt(3)*[224 * x.^3 - 516 * x.^2 + 388 * x - 95;672 * x.^2 - 1032 * x + 388;1344 * x - 1032;1344];
%     g4 = [-280 * x.^3 + 660 * x.^2 - 510 * x + 129;-840 * x.^2 + 1320 * x - 510;-1680*x+1320;-1680];
%     g = [g1 g2 g3 g4];
% elseif x == 1/2
%     g1 = sqrt(7)*[0;0;0;768];
%     g2 = sqrt(5)*[0;0;384;0];
%     g3 = sqrt(3)*[0;80;0;2688];
%     g4 = [8;0;960;0];
%     g = [g1 g2 g3 g4];
% else 
%     error('ERROR!!输入的x不在[0,1]内！');
% end
% 
% end


end