% 绘制三种类型的B样条曲线，需要前面所给的所有.m文件
clear all;
%控制顶点
% x=-2:0.05:2-0.05;
% y=sin(2*x)+2*exp(-30*x.^2)+2;
% dy = gradient(y);
% dx = gradient(x);
% quiver(x,y,-dy,dx)
% hold on; 
% plot( x, y)
% P = [x;y];
% P = [9.036145, 21.084337, 37.607573, 51.893287, 61.187608;
%     51.779661, 70.084746, 50.254237, 69.745763, 49.576271];
P=[-2,2.75680249530793;-2.09788384428410,2.88553455551147;-1.88774889811174,2.55852445989895;-1.43621292043343,1.80957205031100;-1.30482441837508,1.48434854955646;-1.13305768423676,1.20022793249318;-0.815668304897256,0.964289302880623;-0.478371134787551,1.08074683048959;-0.260333396281874,1.52738681763628;-0.170792894848791,2.45801149675944;-0.0838752168148864,3.72513035625079;0.0685397538474079,4.03863129704955;0.207935241854764,3.00790364352619;0.422389966310799,2.53930314756044;0.729822969815806,3.01549403263043;1.05083613430508,3.02527972955001;1.29604828750822,2.54413869736835;1.50458593494631,2.08343988381207;1.71789908959668,1.70356867470970;1.87017156394036,1.44071769407371;1.95000000000000,1.31223384081603];

P=P';
% n = length(x)-1; k = 2;
n = 20; k = 3;

flag = 2;
% flag = 1，绘制均匀B样条曲线
% flag = 2, 绘制准均匀B样条曲线
% flag = 3, 绘制分段Bezier曲线
 
switch flag
    case 1
        NodeVector = linspace(0, 1, n+k+2); % 均匀B样条的节点矢量
 
        % 绘制样条曲线
        plot(P(1, 1:n+1), P(2, 1:n+1),...
                        'o','LineWidth',1,...
                        'MarkerEdgeColor','k',...
                        'MarkerFaceColor','g',...
                        'MarkerSize',6);
        line(P(1, 1:n+1), P(2, 1:n+1));
        Nik = zeros(n+1, 1);
        for u = k/(n+k+1) : 0.001 : (n+1)/(n+k+1)
            % for u = 0 : 0.005 : 1
            for i = 0 : 1 : n
                Nik(i+1, 1) = BaseFunction(i, k , u, NodeVector); 
            end
        p_u = P * Nik;
        line(p_u(1,1), p_u(2,1), 'Marker','.','LineStyle','-', 'Color',[.3 .6 .9]);
        end
    case 2
        NodeVector = U_quasi_uniform(n, k); % 准均匀B样条的节点矢量
        DrawSpline(n, k, P, NodeVector);
    case 3
        NodeVector = U_piecewise_Bezier(n, k);  % 分段Bezier曲线的节点矢量
        DrawSpline(n, k, P, NodeVector);
    otherwise
        fprintf('error!\n');
end