function v1nij_x = v1nij(n,i,j,x)
%V1N 此处显示有关此函数的摘要
%   此处显示详细说明
    v1nij_x=0;
if n==1 &i==0
    v1nij_x=1;
elseif n==1 & i==1
    v1nij_x=3^0.5*(1-2*x);
elseif n==2 & i==1
    v1nij_x=3^0.5*(1-4*x)*(x>=0&x<0.5)+3^0.5*(4*x-3)*(x>=0.5<=1);
elseif n==2 & i==2
    v1nij_x=(1-6*x)*(x>=0&x<0.5)+(5-6*x)*(x>=0.5&x<1);
elseif n>2
    if i==1
        v1nij_x=(3*2^(n-2))^0.5*(4*j-3-2^n*x)*(x>(j-1)/(2^(n-2))&x<(2*j-1)/(2^(n-1)))+...
            (3*2^(n-2))^0.5*(2^n*x-4*j+1)*(x>(2*j-1)/(2^(n-1)&x>j/(2^(n-2))));
    elseif i==2
        v1nij_x=(2^(n-2))^0.5*(6*j-5-3*2^(n-1)*x)*(x>(j-1)/(2^(n-2))&x<(2*j-1)/(2^(n-1)))+...
            (2^(n-1))^0.5*(6*j-1-3*2^(n-1)*x)*(x>(2*j-1)/(2^(n-1)&x>j/(2^(n-2))));
    end
end



end

